import {
  功能定义 as 禁止滚轮缩放,
  主程序功能 as 禁止滚轮缩放主程序功能,
} from './功能/禁止滚轮缩放.js'
import {
  功能定义 as 自适应棋盘,
  主程序功能 as 自适应棋盘主程序功能,
  功能恢复 as 自适应棋盘功能恢复,
  socket功能 as 自适应棋盘socket功能,
  覆盖层功能 as 自适应棋盘覆盖层功能,
} from './功能/自适应棋盘.js'
import {
  功能定义 as 地图大小标签,
  功能恢复 as 地图大小标签功能恢复,
} from './功能/地图大小标签.js'
import {
  功能定义 as 玩家颜色统一,
  socket功能 as 玩家颜色统一socket功能,
  功能样式 as 玩家颜色样式,
} from './功能/玩家颜色.js'
import {
  功能定义 as 大回合倒计时,
  主程序功能 as 大回合倒计时主程序功能,
  功能恢复 as 大回合倒计时功能恢复,
  socket功能 as 大回合倒计时socket功能,
  功能样式 as 大回合倒计时样式,
} from './功能/大回合倒计时.js'
import {
  功能定义 as 回合结束提示,
  功能恢复 as 回合结束提示功能恢复,
} from './功能/回合结束提示.js'
import {
  功能定义 as 战场数据差,
  主程序功能 as 战场数据差主程序功能,
  功能恢复 as 战场数据差功能恢复,
  socket功能 as 战场数据差socket功能,
  功能样式 as 战场数据差样式,
} from './功能/战场数据差.js'
import {
  功能定义 as 战场塔信息,
  主程序功能 as 战场塔信息主程序功能,
  功能恢复 as 战场塔信息功能恢复,
  socket功能 as 战场塔信息socket功能,
  功能样式 as 战场塔信息样式,
} from './功能/战场塔信息.js'
import {
  功能定义 as 敌方开塔提示,
  功能恢复 as 敌方开塔提示功能恢复,
  socket功能 as 敌方开塔提示socket功能,
} from './功能/敌方开塔提示.js'
import {
  功能定义 as 我方行动监控,
  主程序功能 as 我方行动监控主程序功能,
  功能恢复 as 我方行动监控功能恢复,
  socket功能 as 我方行动监控socket功能,
  地图更新功能 as 我方行动监控地图更新功能,
} from './功能/我方行动监控.js'
import {
  功能定义 as 游戏数据进展图表,
  主程序功能 as 游戏数据进展图表主程序功能,
  功能恢复 as 游戏数据进展图表功能恢复,
  socket功能 as 游戏数据进展图表socket功能,
} from './功能/游戏数据进展图表.js'
import {
  功能定义 as 回放系统,
  主程序功能 as 回放系统主程序功能,
  功能恢复 as 回放系统功能恢复,
  socket功能 as 回放系统socket功能,
} from './功能/回放系统.js'
import {
  功能定义 as 塔记忆标记,
  功能恢复 as 塔记忆功能恢复,
  socket功能 as 塔记忆socket功能,
  覆盖层功能 as 塔记忆覆盖层功能,
} from './功能/塔记忆.js'
import {
  功能定义 as 基地记忆标记,
  功能恢复 as 基地记忆功能恢复,
  socket功能 as 基地记忆socket功能,
  覆盖层功能 as 基地记忆覆盖层功能,
} from './功能/基地记忆.js'
import {
  功能定义 as 基地危险提醒,
  功能恢复 as 基地危险功能恢复,
  socket功能 as 基地危险socket功能,
  功能样式 as 基地危险样式,
} from './功能/基地危险.js'
import {
  功能定义 as 敌方基地推测,
  功能恢复 as 敌方基地推测功能恢复,
  socket功能 as 敌方基地推测socket功能,
} from './功能/敌方基地推测.js'
import {
  功能定义 as 未到达视野,
  功能恢复 as 未到达视野功能恢复,
  socket功能 as 未到达视野socket功能,
  地图更新功能 as 未到达视野地图更新功能,
  覆盖层功能 as 未到达视野覆盖层功能,
} from './功能/视野.js'
import {
  功能定义 as 障碍物标记,
  功能恢复 as 障碍物标记功能恢复,
  socket功能 as 障碍物标记socket功能,
  地图更新功能 as 障碍物标记地图更新功能,
  覆盖层功能 as 障碍物覆盖层功能,
} from './功能/障碍物标记.js'
import {
  功能定义 as 兵力分布着色,
  主程序功能 as 兵力分布着色主程序功能,
  功能恢复 as 兵力分布着色功能恢复,
  socket功能 as 兵力分布着色socket功能,
  地图更新功能 as 兵力分布着色地图更新功能,
  覆盖层功能 as 兵力分布覆盖层功能,
} from './功能/兵力分布着色.js'
import {
  功能定义 as 敌方移动高亮,
  功能恢复 as 敌方移动高亮功能恢复,
  socket功能 as 敌方移动高亮socket功能,
  地图更新功能 as 敌方移动高亮地图更新功能,
  覆盖层功能 as 敌方移动覆盖层功能,
} from './功能/敌方移动高亮.js'
import {
  功能定义 as 敌方主力标记,
  功能恢复 as 敌方主力标记功能恢复,
  socket功能 as 敌方主力标记socket功能,
  地图更新功能 as 敌方主力标记地图更新功能,
  覆盖层功能 as 敌方主力覆盖层功能,
} from './功能/敌方主力标记.js'
import {
  功能定义 as 抢塔提示,
  功能恢复 as 抢塔提示功能恢复,
  socket功能 as 抢塔提示socket功能,
  地图更新功能 as 抢塔提示地图更新功能,
  覆盖层功能 as 抢塔覆盖层功能,
} from './功能/抢塔提示.js'
import {
  功能定义 as 移动队列轨迹,
  功能恢复 as 移动队列功能恢复,
  socket功能 as 移动队列socket功能,
  覆盖层功能 as 移动队列覆盖层功能,
} from './功能/移动队列.js'
import {
  功能定义 as 选中棋子提示,
  功能恢复 as 选中棋子提示功能恢复,
  覆盖层功能 as 选中棋子覆盖层功能,
} from './功能/选中棋子提示.js'
import {
  功能定义 as 自动保护基地,
  功能恢复 as 自动保护基地功能恢复,
  socket功能 as 自动保护基地socket功能,
} from './功能/自动保护基地.js'
import {
  功能定义 as 自动吃基地,
  功能恢复 as 自动吃基地功能恢复,
  socket功能 as 自动吃基地socket功能,
} from './功能/自动吃基地.js'
import { socket功能 as 战场数据冻结socket功能 } from './功能/战场数据冻结.js'

export const 功能列表 = [
  禁止滚轮缩放,
  自适应棋盘,
  地图大小标签,
  玩家颜色统一,
  大回合倒计时,
  回合结束提示,
  战场数据差,
  战场塔信息,
  敌方开塔提示,
  我方行动监控,
  游戏数据进展图表,
  回放系统,
  塔记忆标记,
  基地记忆标记,
  基地危险提醒,
  敌方基地推测,
  未到达视野,
  障碍物标记,
  兵力分布着色,
  敌方移动高亮,
  敌方主力标记,
  抢塔提示,
  移动队列轨迹,
  选中棋子提示,
  自动保护基地,
  自动吃基地,
]

export const 覆盖层功能列表 = [
  自适应棋盘覆盖层功能,
  未到达视野覆盖层功能,
  障碍物覆盖层功能,
  兵力分布覆盖层功能,
  移动队列覆盖层功能,
  敌方移动覆盖层功能,
  塔记忆覆盖层功能,
  抢塔覆盖层功能,
  基地记忆覆盖层功能,
  敌方主力覆盖层功能,
  选中棋子覆盖层功能,
]

export const 主程序功能列表 = [
  禁止滚轮缩放主程序功能,
  自适应棋盘主程序功能,
  大回合倒计时主程序功能,
  战场数据差主程序功能,
  战场塔信息主程序功能,
  我方行动监控主程序功能,
  游戏数据进展图表主程序功能,
  回放系统主程序功能,
  兵力分布着色主程序功能,
].filter(Boolean)

export const 功能恢复列表 = [
  自适应棋盘功能恢复,
  地图大小标签功能恢复,
  大回合倒计时功能恢复,
  回合结束提示功能恢复,
  战场数据差功能恢复,
  战场塔信息功能恢复,
  敌方开塔提示功能恢复,
  我方行动监控功能恢复,
  游戏数据进展图表功能恢复,
  回放系统功能恢复,
  塔记忆功能恢复,
  基地记忆功能恢复,
  基地危险功能恢复,
  敌方基地推测功能恢复,
  未到达视野功能恢复,
  障碍物标记功能恢复,
  兵力分布着色功能恢复,
  敌方移动高亮功能恢复,
  敌方主力标记功能恢复,
  抢塔提示功能恢复,
  移动队列功能恢复,
  选中棋子提示功能恢复,
  自动保护基地功能恢复,
  自动吃基地功能恢复,
].filter(Boolean)

export const socket功能列表 = [
  战场数据冻结socket功能,
  大回合倒计时socket功能,
  玩家颜色统一socket功能,
  移动队列socket功能,
  塔记忆socket功能,
  基地记忆socket功能,
  敌方基地推测socket功能,
  基地危险socket功能,
  战场塔信息socket功能,
  战场数据差socket功能,
  游戏数据进展图表socket功能,
  敌方开塔提示socket功能,
  自动保护基地socket功能,
  自动吃基地socket功能,
  回放系统socket功能,
  自适应棋盘socket功能,
  敌方主力标记socket功能,
  抢塔提示socket功能,
  未到达视野socket功能,
  障碍物标记socket功能,
  兵力分布着色socket功能,
  我方行动监控socket功能,
  敌方移动高亮socket功能,
].filter(Boolean)

export const 地图更新功能列表 = [
  敌方移动高亮地图更新功能,
  敌方主力标记地图更新功能,
  抢塔提示地图更新功能,
  我方行动监控地图更新功能,
  障碍物标记地图更新功能,
  兵力分布着色地图更新功能,
  未到达视野地图更新功能,
].filter(Boolean)

export const 功能样式列表 = [
  玩家颜色样式,
  大回合倒计时样式,
  战场数据差样式,
  战场塔信息样式,
  基地危险样式,
].filter(Boolean)
